#include "bsp_beep.h"

static void Beep(u16 xms);

/*
*********************************************************************************************************
*  函 数 名: BEEP_Init
*  功能说明: 初始化蜂鸣器
*  形    参: str: 一个byte
*  返 回 值: 无
*********************************************************************************************************
*/
void BEEP_Init(void)
{
	GPIO_InitTypeDef BEEP_InitStruct;
	
	/* 初始化时钟使能 */
	RCC_APB2PeriphClockCmd(BEEP_GPIO_CLK, ENABLE);

	/* 配置GPIO结构体 */
	BEEP_InitStruct.GPIO_Pin = BEEP_PIN;
	BEEP_InitStruct.GPIO_Mode = GPIO_Mode_Out_PP;
	BEEP_InitStruct.GPIO_Speed = GPIO_Speed_2MHz;

	GPIO_Init(BEEP_GPIO_PORT, &BEEP_InitStruct);

	BEEP_OFF;
}

/*
*********************************************************************************************************
*  函 数 名: Beep
*  功能说明: 鸣叫指定时长
*  形    参: 	xms: 毫秒
*  返 回 值: 无
*********************************************************************************************************
*/
static void Beep(u16 xms)
{
	  BEEP_ON;
	  delay_ms(xms);
	  BEEP_OFF;
	  delay_ms(xms);
}

/*
*********************************************************************************************************
*  函 数 名: Short_Beep
*  功能说明: 短鸣叫
*  形    参: 无
*  返 回 值: 无
*********************************************************************************************************
*/
void Short_Beep(void)
{
	  Beep(100);
}

/*
*********************************************************************************************************
*  函 数 名: Short_Beep
*  功能说明: 长鸣叫
*  形    参: 无
*  返 回 值: 无
*********************************************************************************************************
*/
void Long_Beep(void)
{
	  Beep(500);
}

/*
*********************************************************************************************************
*  函 数 名: Beep_OK
*  功能说明: 定义成功鸣叫
*  形    参: 无
*  返 回 值: 无
*********************************************************************************************************
*/
void Beep_OK(void)
{
	Short_Beep();	 
	Short_Beep();
	Long_Beep();
}




